class PoemData {
  final String title;
  final String tag;
  final String content;

  const PoemData({
    required this.title,
    required this.tag,
    required this.content,
  });
}

const List<PoemData> poems = [
  PoemData(
    title: '候車',
    tag: '諦深 · 2026.6.1',
    content: '一眾列侯長站台，\n七七八八箱包排；\n繁花美景均無視，\n只盯是否火車來！',
  ),
  PoemData(
    title: '庶人',
    tag: '諦深 · 2026.6.1',
    content: '腳前碧海腳後山，\n左首鏡湖印藍天；\n是處若非仙人居，\n定立豪傑此地間！',
  ),
  PoemData(
    title: '錯搭窩',
    tag: '諦深 · 2026.6.1',
    content: '峽谷河灘熱如灸，\n老衲掩蓬坐中休；\n窸窸窣窣禪衣動，\n尋處搭窩小鳥抽！',
  ),
  PoemData(
    title: '2023中秋賞月',
    tag: '諦深 · 2023.09.29',
    content: '停車湖岸葉敲窗，明月雙映縱秋傷；願聞蟲鳴悠悠唱，不思獨夫嘖酒香！',
  ),
  PoemData(
    title: '給誹謗我諦深的人寫個曲子',
    tag: '諦深 · 2023.08.01',
    content: '諦深和尚推倒墻，各路老鼠逃命忙；魔王畫皮佛協旗，碩鼠一呼諸鼠強。裝起鼠膽成英豪，為貪利養揮刀向：密宗鼠，趕緊咒，欲令諦深喝黃湯；淨土鼠，土飛揚，利令毀罵諦深場；禪宗鼠，鎖眉罡，挖掉祖墳埋師荒；邪教馬氏鼠輩族，一流邪氣吹壇場！桶桶鼠尿洗僧腦，大旗插進佛道場！開鼠會，定規章，先黑諦深控網上！豈知諦深是光芒，鼠群騷氣風再強，刮光愚癡夢一場！諦深奉勸佛門賊，因緣果報汝必嚐！大賊小賊一鍋燴，地獄之鍋賊須倘！',
  ),
  PoemData(
    title: '和尚三字經',
    tag: '諦深 · 2023.07.31',
    content: '坐一天，坐天天，於是乎，坐年年；山峰去，海變田；原成山，山成原；一灣水，星星繁；火山爆，森火傳；童子面，銀鬚臉；閉目休，眾生瞻，無量壽，睜眼還！我還我，我我連；佛國園！',
  ),
  PoemData(
    title: '為僧',
    tag: '諦深 · 2021.04.04',
    content: '過一山，再一山，雪線扯，紅花牽，遠湖水，白雲沾；過一天，再一天，朝日紅，夜星繁，近溪鳴，鶯聲歡；走一環，再一環，兩鬢白，花甲連，外鐘聲，山谷傳；走一年，再一年，半生了，弟子滿，里清香，世界衍。坐壇幾十載東方，生無量寶蓮；設度大船西界，令眾出離險難。種下沙數種，儲滿甘露田，補好破衣衫，回兜率，靜候桃李芬芳，碩果滿，一眨眼五百年。諦深2021年4月4日',
  ),
  PoemData(
    title: '歐洲苦行',
    tag: '諦深 · 2021.03.26',
    content: '緣一絲，因分誕，走娑婆，戏八萬，驚喬裝，滅巧語花言。華夏正污濁，池底虹霓翻，水渾泥潭稱正道，小小魔王袈裟堪，竟，稱賢。手執杵，揮如鞭，策天龍，出塞關，離震旦，走地球另端。湖水清澈碧，綠草接藍天，剎印雪山路，阿爾卑斯峰，白雲繫寶塔，示，梵天。日半桿，又半桿，縫衲衣，佛陀蔓，起玉板，明燈立萬山。諦深2021年3月26日寫給坐下苦行弟子',
  ),
  PoemData(
    title: '聽雨',
    tag: '諦深 · 2020.07.21',
    content: '透窗玻璃有斜陽，砰砰啪啪雨敲牆；涮呼譁然霹靂霍，樹草潭臺織交響。諦深2020/7/21',
  ),
  PoemData(
    title: '高考',
    tag: '諦深 · 2020.07.08',
    content: '一紙黑字搭關橋，千軍萬馬過如潮；兩岸官民擂鼓助，一決雌雄握筆描。——諦深大師2020.7.8',
  ),
  PoemData(
    title: '韋馱讚',
    tag: '諦深 · 2020.06.17',
    content: '率眾護法剎無憂，魔聞魂飛成善酋；三門清淨韋馱界，令眾離苦功不休！——摘自《諦深大師詩摘要》2020.6.17',
  ),
  PoemData(
    title: '讚地藏',
    tag: '諦深 · 2020.4.6',
    content: '罪苦不盡有緣由，惡鬼畜牲無需愁。金錫無礙滅罪孽，一稱地藏罪可休。——諦深2020.4.6',
  ),
  PoemData(
    title: '時間',
    tag: '諦深 · 2020.3.11',
    content: '日出三桿桿桿長（zhang），一桿一間定工忙；晝夜分成桿桿格，陪伴眾生生命廊。熟知此為動動戲，化作時空有地黃。諦深2020.3.11\n\n（阿彌陀佛，2020年3月11日，因弟子向師父求詩，師父半個小時的時間，就寫了六首詩。師父太忙，能擠出半個小時，已然足矣。師父作詩，從不需思考，不需潤色，都是一揮而就！）',
  ),
  PoemData(
    title: '路',
    tag: '諦深 · 2020.3.11',
    content: '一步一印落地荒，後來之者隨跡韁，亦有車乘先拓造，諸經錯綜成世綱。諦深2020.3.11',
  ),
  PoemData(
    title: '地圖',
    tag: '諦深 · 2020.3.11',
    content: '萬水千山一寸長，華夏不過半尺量；熟知佛界由旬計；虛空卻放塵子旁！諦深2020.3.11',
  ),
  PoemData(
    title: '雨',
    tag: '諦深 · 2020.3.11',
    content: '小小分子越空間，遭寒集聚做雲天；體大空氣托不住，掉落大地稱雨甘。諦深2020.3.11',
  ),
  PoemData(
    title: '憋詩',
    tag: '諦深 · 2020.3.11',
    content: '自作聰穎自作情，字字蹩腳生生凝；李白杜甫均嗤之，書書揉團置地成！諦深2020.3.11',
  ),
  PoemData(
    title: '狂',
    tag: '諦深 · 2020.3.11',
    content: '無知為知做道言，不敬天地自作前；苦難臨時罡不濟，命終怨恨睛不轉；和尚勸眾多修道，勿待死時恨命短；少對佛門說三四，留下福德子孫傳。諦深2020.3.11',
  ),
  PoemData(
    title: '貧僧',
    tag: '諦深 · 2019.07.06',
    content: '凡夫甩桿釣魚豚，太公甩桿為釣人；貧僧掛得草鞋處，時時留桿召天神！諦深2019.7.6',
  ),
  PoemData(
    title: '戒相稱僧',
    tag: '諦深 · 2019.03.23',
    content: '天也長，地也長， 人生終處不知遑，不修佛法，好淒涼！累累累、罪罪罪，人間正道是滄桑，世人以是稱明智，愚癡廣。路也長，水也長， 戒律為僧真故鄉，披納衣，极乐方！閑閑閑、樂樂樂，慣看邪道跳廣樑，是故佛陀賢眾生，慧燈亮！天也朗，地也朗，穹樑嚴，鐘鼓撞， 慈聲悲音大眾唱， 海印洗盡千古浪，白玉塔，黃金旺！ 指我座處生檀香，戒定也，留與汝等為佛子，救十方！諦深2019，3，23。',
  ),
  PoemData(
    title: '妙湛寺值更',
    tag: '諦深 · 2017.12.12',
    content: '夜中草櫻連星空，湖色不遮圍山松；一鳴夜鶯耳中悅，妙湛寺香入息中！諦深2017.12.12',
  ),
  PoemData(
    title: '畫畫',
    tag: '諦深 · 2016.2.22',
    content: '信手拈來山水綠，隨心喚出百鳥情；妙筆能生萬花栩，墨水會變仙人行。不用春暖草便碧，一描油燈千古明。----以此送給妙湛寺建設的弟子們。諦深2016.2.22',
  ),
  PoemData(
    title: '萬劫--給喝茶僧',
    tag: '諦深 · 2006.11.28',
    content: '一步一尺，何時走完塵世路？萬境萬劫，戒中自進兜率天！',
  ),
  PoemData(
    title: '又來了',
    tag: '諦深 · 2006.11.30',
    content: '一雙草鞋登崖雄，崎嶇平坦九州同；竹竿濺水度盲客，手捻明珠鐘聲洪！',
  ),
  PoemData(
    title: '行 腳 東 土',
    tag: '諦深 · 2005.08.17',
    content: '佛陀金指向東天，半片黃葉為大船；西方來時只有舵，如今弟子佇甲板；兜率老僧清風助，一時菩薩滿嶗山。',
  ),
  PoemData(
    title: '行 腳 詞',
    tag: '諦深 · 2005.10.31',
    content: '釋迦末法走遍娑婆只嶗山最勝，尋了弟子慈悲顯隱去假相行頭；但願眾生依此律從苦中出來，莫拿自見當佛法枉修瞎練，且記住本性障礙須放下才能成就；更莫提剃頭背經亂佛承事害人害己！無德人休性急論貧納頭足，老朽將法傳將去勿疑勿憾，入門吧照此下去必獲成就！',
  ),
  PoemData(
    title: '那羅延窟觀善境',
    tag: '諦深 · 2005.08.15',
    content: '悠然海中築巨牆，嶗山清水足下涼；不識冥冥天神境，只顧稱奇仙人忙；日出則明雲作怪，蒙瞪觀峰倚廣樑；真真地是夢不如，此處定是住天王；醉心踏破鞋不知，由此還童成兒郎。',
  ),
  PoemData(
    title: '草 庵 品 茶',
    tag: '諦深 · 2005.08.31',
    content: '一把泥壺問道底，嶗山夜雨醒人家；本來想品一小口，不覺三更飲乾江；勸君採擷帶回京，百花不及一茶香。',
  ),
  PoemData(
    title: '無題',
    tag: '諦深 · 2005.11.30',
    content: '一絲黃芽趴土中，不報春來不罷休；蟬歡翠柳溪邊客，激流水中魚蹦丟；風捲黃葉明秋近；面如核桃人將秋；君子莫貪塵世路，人生孰能出神州。',
  ),
  PoemData(
    title: '無題3',
    tag: '諦深 · 2005.11.27',
    content: '一路淨風浴盡， 萬里祥雲雪飄；西來半塵千山， 東去念妄億霄；還我弟子山來！ 悲淚何時能了？但願人人無苦， 從此放下成道！',
  ),
  PoemData(
    title: '2014端午節',
    tag: '諦深 · 2014.06.02',
    content: '端午節前熱燥天，春裝換作夏裝穿；似有烏雲南天起，爽風攜雨瀉屋乾；飛燕早知天中事，窩下補泥如媧仙；不知何處兒童戲，穿透雨聲送吉籤。',
  ),
  PoemData(
    title: '無題十三',
    tag: '諦深 · 2014.01.01',
    content: '生生世世鑄金身，風吹雨淋不變魂；世態炎涼與眾過，慣看黃草火中輪；十方世界我盡住，慈悲成劫度舟本；借此祝願明智人，莫錯機緣隨草沈。',
  ),
  PoemData(
    title: '詩歌大鼓調：說皇',
    tag: '諦深 · 2013.04.23',
    content: '指牆外，花飄香，萬生趁春忙。種種首、種種王，引族稱霸並非狂，吾謂之，強！一國土，萬蟲各自治，君信否？否觀螞蟻有億皇，蜂住處橫刀立馬孰與比，其自視非為王？其真王。人無自知枉為人，咬文嚼字明人坊，自應當！想李白、思杜甫，真人也，跨下千君去，餒死亦勝飽死狼，傳世祥。指舍內，獨坐長，春秋戰國自了去，風雲起，狂濤狂，時過境定遷，何須為之傷，笑一聲，呵呵，問君能有幾多愁，前後無始亦無終，當做回頭郎！',
  ),
  PoemData(
    title: '何須求變！',
    tag: '諦深 · 2013.04.12',
    content: '山不長、水不長，歷史更無再始皇，人們夢中追夢江。思古國，金甲立，銀槍長，於當今，只說書人嘴巴忙，豈知戰場已成洋，三千帆斬波強，孰留芳！世無常、人無常，古今中外幻是綱，生為始，死為亡，如意真命好兒郎。踏碎英豪骨，情奪美人坊；立邦死灰去，沈魚化草黃，知人路何方！山不長，水不長，轉眼千載世，春夏秋冬花變果，觀世間，忙忙忙，呵呵我睡了，管他天老地不荒！',
  ),
  PoemData(
    title: '釣魚島一首！',
    tag: '諦深 · 2012.09.13',
    content: '東海之水藍不窮， 嶗頂閱洋諸島從；思有關羽大將在， 溫酒即回衣風龍！書生意氣雲為馬， 只引天兵過草叢；倭寇自為水湧起， 我等不過兒戲童；中華子孫多大智， 閑賦亦成萬代雄！',
  ),
  PoemData(
    title: '中秋留客',
    tag: '諦深 · 2011.09.12',
    content: '風亦留，雨亦留，風雨聯潮烈渚頭，似有百萬雄獅吼，留！留！留！勿問幾時明月有！情亦留，誼亦留，情誼共沐話仲秋，市井雨絲染虹樓！世態炎涼君莫愁，勸君痛飲幾杯酒！聞谷溪，通海流，蟲鳴樂，鳥歌啾，有道人享滿耳秋！笑君曰，幾時明月幾時暗，幾時有人命永久，莫做百年侯！',
  ),
  PoemData(
    title: '奇雨',
    tag: '諦深 · 2011.05.01',
    content: '山峰俏，雲騰繞，流雲相撲如过招，晨曦披戰袍！閃電照，雷鼓妙，濺雨激情過虹橋，甘露洗千凹！驟雨去，萬花拋，兵馬已遠海中嶗，一路春意一路嬌，鳥語知多少！',
  ),
  PoemData(
    title: '背包詞',
    tag: '諦深 · 2011.04.15',
    content: '金雉又遇呱呱喚，聞如故，興如瀾。日出又成霞一片，海依舊，境變遷。穿時間，一天天，行過嚴冬入春暖，風雪換雨洗千山。走史篇，一年年，讀罷西歐閱東天，磐石不死風剝殘。歎！新之生，老不堪，大地不過這等閒！問君能有幾多志，天不曾狂容宇寰！（轉自諦深大師行腳偈）',
  ),
  PoemData(
    title: '三月初七賞花',
    tag: '諦深 · 2011.04.10',
    content: '青松不動風自暖，爛漫山花層層染；一只獨秀雖萬說，不及幽中秀映潭。皇帝啻令猶下氣，蚊蠅嗅得遮布丸；觀止聖人流放路，君子不屑為熊殘！廣聞天下香不盡，只把餘味盡嶗山！\n\n注：微微的風暖暖的，松樹一動也不動.......',
  ),
  PoemData(
    title: '九月九時令',
    tag: '諦深 · 2009.10.23',
    content: '山也長，水也長，明鏡告知髮染霜，夢中嘆息把尺量，人生如是這般長。一更響，二更響，三更露珠落鋪場，淺野雜草扶弱牆，深山茅屋好秋涼！心也朗，天也朗，人間互助莫相攘，愛心福久長，路更長！',
  ),
  PoemData(
    title: '冬夜曲',
    tag: '諦深 · 2009.01.08',
    content: '觀天河，望星畔，有牛郎星擔；入草籬，燭動焰，念天神那邊！微風起，聽物喚，激起心浪一點；偶耳鳴，聞淨語，人生如是這般！人一生最難得，無愧世間，心無牽！',
  ),
  PoemData(
    title: '秋雨歸圖',
    tag: '諦深 · 2007.01.03',
    content: '風亦爽，雨亦爽，風雨共，秋天涼，突如其來雷爆響，膽驚顫，心更涼；跑一場，駐一場，亂捉襟，願難償，路遙不能一步當，思衣添，暗神傷。自古汗青幾多真，丹心濺水心更強，祝君曰，莫頹廢，更自強！',
  ),
  PoemData(
    title: '靜字令',
    tag: '諦深 · 2007.01.01',
    content: '孤夜法鼓停，殘風弱至不能聆；一干朝者回寮去，互問幾時大雁鳴；聲高嗷，忽然定，只氣息，傳廊庭。印堂井然大字曰：靜！一字寧。',
  ),
  PoemData(
    title: '苦',
    tag: '諦深 · 2007.01.01',
    content: '多少眾生嘆苦毒？豈知自己不捨苦！遇事總是自己成！哪知成人成己路！怨天尤人更為癡！切莫害人落獄途！',
  ),
  PoemData(
    title: '無題7',
    tag: '諦深 · 2006.08.26',
    content: '名山大川景物候， 千流萬瀑任君遊；人頭雖比身家小， 頭卻為天身附頭；頭山大川含偉岸， 不到嶗山不識首。',
  ),
  PoemData(
    title: '贈眾生',
    tag: '諦深 · 2006.05.15',
    content: '一條梅花路，處處留寒香；人人皆稱讚，唯僧嘆苦霜；罷了罷了去，花落夢一場；如是諸人等，醒了又咋樣？摘自師父行腳偈',
  ),
  PoemData(
    title: '讚大士',
    tag: '諦深 · 2006.03.23',
    content: '滴雨清聲千心繫，島山露水個普陀；玉鳥金音梵香起，落錘神鼓破塵鎖；洗苦離難送君去，萬福淨慧浴世洛；觀音大士聖妙道，蓮開萬國助彌陀！',
  ),
  PoemData(
    title: '讚峨嵋',
    tag: '諦深 · 2006.03.04',
    content: '峨嵋一座在西南， 王母率眾來朝山；遊來遊去不見頂，趕緊差人去尋天；菩薩授其一咒語，原来只在山腳邊！',
  ),
  PoemData(
    title: '福 報 僧',
    tag: '諦深 · 2006.02.15',
    content: '天天積功德，歲歲保平安；生生走福路，劫劫坐智單；問問修行人，何者謂佛傳？',
  ),
  PoemData(
    title: '立 春',
    tag: '諦深 · 2006.02.13',
    content: '此番雲散去，靈鳥逐群隨；枚枚竹筍爆，春節聚神心；廟中清香起，糧生無數銀；諸花隨風戲，商隊籌年新；一年萬相起，唯僧睡廣金。',
  ),
  PoemData(
    title: '春 風',
    tag: '諦深 · 2006.02.13',
    content: '大風刮三天，寒池化春潭；雪融潤肥土，嫩芽迎花仙；廟內念佛聲，悠悠繞樑簷；不知多少事，隨風落為田。',
  ),
  PoemData(
    title: '嘆 民 女',
    tag: '諦深 · 2006.01.21',
    content: '腳下土灰塵洗面，汗積滄桑問月天；楊柳細腰成水桶，白嫩臉蛋化黃氈；天天都有煩心事，夢裡都怕飯碗乾；爭爭欲入達官境，夜來秋草殘心塹；若有空閑思命路，黃泉路上哭萬年。',
  ),
  PoemData(
    title: '雨中登頂',
    tag: '諦深 · 2006.01.08',
    content: '（ 抬頭）不見山高，不見雲飄，低頭山凹拔霧顯，繁星掛指梢；欲生靜，鳥不饒，叫聲破所夢，飛影引思橋，雲海峰峰成仙島，烈曰晴空照。似道鐘敲，似雨在澆，雲上我獨尊，雲下萬般妙，閉目萬緣成過去，側耳未來夢如套。環境裡，風不止，音聲中，狂人叫；螞蟻知勤奮，飛蟲亦辛勞，唯皇權撒尿照，自嗅也，愚至不知有天高，更鼓噪！（抬頭）不見山高，不見雲飄，上山下山君自選，雄心亦或正年少，轉眼十年比瞬小，人生這般了！（ 抬頭）不見山高，不見雲飄，細細聽，溪聲咽，海浪笑，恰似不把劍出鞘，劍岀鞘！',
  ),
  PoemData(
    title: '海樂一章',
    tag: '諦深 · 2006.01.08',
    content: '海---勇氣聚，生滅相，風吹雨打織成裝！大江咆、大河哮，捲著浪一路狂！入海後，悄然亡！海---聚濤來，轟轟響；散落去，流風涼；碧海藍天兩相長！烏雲起，炸雷向，滴雨一生演悵茫！心---自負成蟻擊大象，吠天生犬欺星王！淚眼世世苦斷腸！萬生萬物心成障！祝來者---善心護事天庭廣，細細賞！',
  ),
  PoemData(
    title: '馬蹄聲中思六郎！',
    tag: '諦深 · 2006.01.07',
    content: '飲塵吞沙走西梁，路無邊，黃昏長；斗篷力挺握鋼槍，野狼嚎，雄鷹蒼； 族興國強偉男志，策馬去，立成牆！ 古佛清燈通西域，善世界，法網廣，馬蹄聲中思六郎----',
  ),
  PoemData(
    title: '海風山東！',
    tag: '諦深 · 2006.01.06',
    content: '銀髮點綴少年頭，豈知年已過半；海風捲濤芝罘島，遠處翠綠塔巔！過崆峒，繞成山，尋訪古國河山；祭田橫，登嶗頂，膠州灣畔清點；走狼牙，佇泗水，泰山小雨河面，孔子、孟子、孫子，還有羲之字半邊，無需嫌，古今人文萬千！但將文明放耳田，紅日總出這邊！君可知，華夏地英雄豪傑遍滿？',
  ),
  PoemData(
    title: '給--湛山寺---被罵的和尚！',
    tag: '諦深 · 2006.01.06',
    content: '生生行路難做命， 莫食布施做馬牛；若於佛法不生信， 三分黃土吃無憂；（哎！做個常人有何難？）何苦斷滅慈悲種，落到地獄烹鬼嗅！汝若不識佛門報， 苦海尋岸鹹透舟；荒原野狼嘆孤溪， 熱漠棘柳鳥更愁；勸君讀破紅塵淚， 極樂國土一路修！',
  ),
  PoemData(
    title: '了願',
    tag: '諦深 · 2006.01.05',
    content: '一路淨風浴盡，萬里祥雲雪飄；西來半塵千山，東去念妄億霄；還我弟子山來！悲淚何時能了？但願人人無苦，從此放下成道！',
  ),
  PoemData(
    title: '嶗山禪坐',
    tag: '諦深 · 2006.01.05',
    content: '蒼穹頭上撐，碧海向無邊；星星周身戲，嫦娥舞耳畔；才聽澗水輕，鶯聲又連綿；不明深洞裡，藏仙幾萬年。',
  ),
  PoemData(
    title: '降牛',
    tag: '諦深 · 2006.01.01',
    content: '佛陀慈悲顯神州，處處皆是善法流；眾生不知自己境，輪輪回回尋緣由；犛牛愛尾尚可悅，老休學術不如牛；人人都是聰明客，如是樂苦一生求。',
  ),
  PoemData(
    title: '訓子歌',
    tag: '諦深 · 2006.01.01',
    content: '萬劫善緣實難遇，罪孽深重疑謗生；一生生死落怨障，世世迭痕遭苦毒；勸子徹心莫愚鈍，橫力拔箭奔樂途。',
  ),
  PoemData(
    title: '嶗山冬晚',
    tag: '諦深 · 2005.12.19',
    content: '天幕灰然落，老君降紫霞；海山連月立，神風谷中發；和尚關門時，老道扣殿閂；獨聖嶗山境，星雪不分家。',
  ),
  PoemData(
    title: '無 常',
    tag: '諦深 · 2005.12.09',
    content: '雲從無中起，雪掛黑雲天；春風雨洗面，秋羲逛峽川；都在夢裡混，飄搖幾數年！',
  ),
  PoemData(
    title: '嘆 醫',
    tag: '諦深 · 2005.12.08',
    content: '呻吟聲聲呼救難，親人心中淚水淹；受罪尚需重金買，離別亦得上路錢；眾生苦時心懼病，不知病根紮心田；念佛一句法風起，狂掃塵勞無病沾；愚人自尋黃泉徑，六道如是轉無邊；且莫妄談佛門事，留條福路子孫傳！',
  ),
  PoemData(
    title: '嶗山問路',
    tag: '諦深 · 2005.12.07',
    content: '贈君一寸路，夢中去凡間；下成天梯掛，上入霄雲端；醒來尋是處，扔在嶗山巔。',
  ),
  PoemData(
    title: '明 醫',
    tag: '諦深 · 2005.12.03',
    content: '月下楓葉落，夜半紫蘭歸；病榻千毒侵，五臟鬼刀飛；閻王自己請，地獄重金堆；離險需善地，浴佛淨風吹；不要不聽勸，年已髦髦垂！',
  ),
  PoemData(
    title: '嶗山天臥',
    tag: '諦深 · 2005.11.27',
    content: '半邊青山半邊天， 另外一半不得觀；峰隙天際巧分界， 玉皇東海造奇觀；總是不見天將接， 原來天地兩世間；都怪龍王飛得快， 夢中拿走龍珠籃。',
  ),
  PoemData(
    title: '遊五嶽思嶗',
    tag: '諦深 · 2005.10.25',
    content: '一絲雲起東海邊，瞬息變化五嶽端；江川湖月君歎遍，似有未盡心不甘；人人人皆稱黃山美，不如海中石景全；此處一攬群山秀，到了嶗山不思天。',
  ),
  PoemData(
    title: '九 水',
    tag: '諦深 · 2005.08.15',
    content: '嶗山澗水應稱江，天上天下一起淌；不能水中賞明月，只因九轉龍亦忙；莫將見底以為淺，豈知水深逾千丈；若待租舟行澗水，轉眼即到海中央；千萬別戀景色美，山海一色難還鄉！',
  ),
  PoemData(
    title: '四季',
    tag: '諦深 · 2017.01.27',
    content: '除夕夜的鐘聲伴著無限之巔的金雞，暢曉春的大地，我送你一件霓裳，你穿上它，拽起暖風，拂醒萬物生機。你想發芽嗎？穿上它，做新春的第一份綠！你想開花嗎？穿上它，和火辣的太陽一起，送給你溫度，也遮出涼意！噢，美麗的你更需要果實，我就把萬紫千紅送你成衣，你可以溫柔的孕育，也可以瘋狂的爆出子粒！當千里冰封，我把鑲著雪花的棉衣送你！請記著我蟈蟈，一針一針給你織成的四季！',
  ),
  PoemData(
    title: '贈蟈蟈（一）',
    tag: '諦深 · 2015.04.01',
    content: '自有紅花點綠妝，累累果實翠成紡。四季夏秋最為盼，得意蟈蟈立樂章。',
  ),
  PoemData(
    title: '贈蟈蟈（二）',
    tag: '諦深 · 2015.04.01',
    content: '細徑掩映入千山，穿針引線為垂簾。靜水婉轉憑欄處，寺院香雲生紅蓮。',
  ),
  PoemData(
    title: '向天下父母致敬！',
    tag: '諦深 · 2008.12.12',
    content: '題記：1、 30年前的上百年中，中國人的生活就是一個字：「苦！」。在長達一個多世紀的漫長歲月裡，世界列強不把我們當人。苦難、災難不是降臨而是浸泡著中國人的腳步。我們的祖輩是用「命」傳承了我們。2、正值紀念改革開放30年的日子，我們向祖輩宣誓，我們一定能秉承遺志繼往開來，讓所有的中國人都站起來過上好日子！讓我們共舉杯，向中華民族的血脈—我們受盡苦難披肝瀝膽的、偉大的父母們，道一聲：謝謝！\n\n嚴父機杼雄雞鳴， 慈母針線正細行；待到朝霞漫天時， 飽暖兒郎迎課鈴。國強民富子凱日， 孰人能忘父母情！',
  ),
  PoemData(
    title: '網祭汶川詞',
    tag: '諦深 · 2008.05.16',
    content: '分秒西蜀，心不流血非君子，幅幅畫面，銘心剃骨！撚日夜，哪能回首半目，驚心動魄，不堪細述！人間真情勝似火，萬馬嘯嘯踏焦土，關閻路，淚成雨，聖水丈夫！君來兮，撒把群星至汶川，燭成日，照亮旅途！',
  ),
  PoemData(
    title: '五臺山',
    tag: '諦深 · 2008.01.01',
    content: '千年萬年慈悲埋，智種善根滿世懷；聖山巍然雲中坐，無邊甘露托五臺。',
  ),
  PoemData(
    title: '落 草',
    tag: '諦深 · 2008.01.01',
    content: '踏路萬年山山無，人間變遷落星宿。恍然銀鬚憐子愣，飛鞭一騎出塵爐。',
  ),
  PoemData(
    title: '青藏賦（2）',
    tag: '諦深 · 2007.01.12',
    content: '青藏深處，野鳥狂舞，唯老鷹悠閒；莫少語，任君喊，綠水驕陽一片！夜深時，篝火旁，星雲直落身邊！吾歸也，千古影，祝祖國平安！ 祝祖國平安！',
  ),
  PoemData(
    title: '藏紅花',
    tag: '諦深 · 2007.01.12',
    content: '藏紅花絲萬縷纖， 金輝華日紫雪山；北側那知冬來早， 一群野鴨飛滿天！',
  ),
  PoemData(
    title: '山里人點滴',
    tag: '諦深 · 2007.01.12',
    content: '塵起旋風紙屑歡， 紅嘴小鳥鑽離欄；嚴冬時節不留客， 熱火紅爐一屋煙！',
  ),
  PoemData(
    title: '天天無事勝有事',
    tag: '諦深 · 2007.01.04',
    content: '天天無事勝有事，歲歲人求得平安；千山萬水不相隔，一覺睡到兜率天；處處都有天和地，事事都有我心願！若要找出我名字，當下即得萬貫產。',
  ),
  PoemData(
    title: '送晚霞！',
    tag: '諦深 · 2007.01.04',
    content: '一縷清風海面，落日紅霞染天；遠近大海總寬闊，山外白帆綴蘭；恍然間日去也，只剩天際掩海；送晚霞，庭院深處朗朗繁星嶗山！',
  ),
  PoemData(
    title: '飲 茶',
    tag: '諦深 · 2007.01.02',
    content: '炎炎持久日， 絲雲飄然風；飲茶世間客， 若若思禪僧。',
  ),
  PoemData(
    title: '端午節',
    tag: '諦深 · 2007.01.02',
    content: '春夏之交米成堆， 銀稻金麥兀南北；遍插艾蒿國人淚， 屈原一去不復回！',
  ),
  PoemData(
    title: '宿明道觀',
    tag: '諦深 · 2007.01.01',
    content: '深草蒼松不遮風， 殘敗山屋無窗櫺；金鳥驚啾高飛去， 軟席螢燈依帳篷。',
  ),
  PoemData(
    title: '暖谷春色',
    tag: '諦深 · 2007.01.01',
    content: '一溪碧水半溪花， 崖下絲霧似為家；翠鳥亦有春計早， 啄啄崖上覓窩趴。',
  ),
  PoemData(
    title: '青藏賦',
    tag: '諦深 · 2007.01.01',
    content: '藍天雲海並不奇，雪山雲海兩相宜；元旦佳節情最貴，國航四心做天梯。',
  ),
  PoemData(
    title: '血色黃昏',
    tag: '諦深 · 2007.01.01',
    content: '門內設門關外關，群雁橫飛進霞灘；雄心壯志留不住，血色黃昏斬魔班！',
  ),
  PoemData(
    title: '雷雨即景',
    tag: '諦深 · 2007.01.01',
    content: '黑雲暴雷奔山窪， 知蟬息鳴葉背趴；學童雖似不怕雨， 門外三尺備回家！',
  ),
  PoemData(
    title: '回燈',
    tag: '諦深 · 2007.01.01',
    content: '憐子憫世渡船突， 眾生苦海驚鯊逐；罪人不識無上面， 飛舟一隙收天書。',
  ),
  PoemData(
    title: '即墨鶴鳴谷',
    tag: '諦深 · 2006.12.11',
    content: '普普通通一山谷，松齡鶴壽無史書；腳踏臺階水鼓奏，擊掌鶴鳴仙人囑！',
  ),
  PoemData(
    title: '冬 至',
    tag: '諦深 · 2006.12.11',
    content: '風吹殘葉樹枝孤， 雲雷不雨花滿屋；冬至時節人最壯， 少年腰有壯年粗！',
  ),
  PoemData(
    title: '落 葉',
    tag: '諦深 · 2006.12.02',
    content: '霞光落葉厚如氈， 萬片飛舞如彩環；紅黃赤橙青蘭紫， 路人戀戀回家難！',
  ),
  PoemData(
    title: '落葉2',
    tag: '諦深 · 2006.12.02',
    content: '遙知落葉在秋天， 坐觀冬天葉如帆；飄飄搖搖如戲蝶， 留下一棵樹稍牽！',
  ),
  PoemData(
    title: '靈 光',
    tag: '諦深 · 2006.11.30',
    content: '翟翟沙海一毫田， 半潭綠水半邊天；飛沙走石寸寸路， 靈光一閃敦煌巖！',
  ),
  PoemData(
    title: '紫羅蘭',
    tag: '諦深 · 2006.11.28',
    content: '風盡明月一尺山，海濤絲雲練木船；畫師筆下一勝景，不如荒島紫羅蘭！',
  ),
  PoemData(
    title: '嶗山昨日雨！',
    tag: '諦深 · 2006.11.19',
    content: '嶗山昨日雨， 山下落葉徐；雲中遊人言， 湛水滿東池！',
  ),
  PoemData(
    title: '小兒郎',
    tag: '諦深 · 2006.11.19',
    content: '雲中小兒郎， 松下識字忙；鳥語花香境， 童聲傳山樑！',
  ),
  PoemData(
    title: '溫 泉',
    tag: '諦深 · 2006.11.15',
    content: '嶗山谷下金海灣， 日日夜夜流清灩；大雪紛飛君莫怕， 熱水彩霧融冰山！此處只配天天上， 青峰碧海戲溫泉！',
  ),
  PoemData(
    title: '人 生',
    tag: '諦深 · 2006.05.21',
    content: '天天如死過， 事事定凡魂；花甲嘆人生， 不如朽木神！',
  ),
  PoemData(
    title: '出門兒',
    tag: '諦深 · 2006.01.07',
    content: '看姨看舅看姑媽， 爬山涉水迎風刮；自古親情擎國盛， 醉酒毛驢馱回家！\n\n注：膠東、海洋、小紀、乳山等地的山裡因山路崎嶇依然有趕、騎毛驢走親戚的風情，很歷史，很親情！',
  ),
  PoemData(
    title: '茶 屋',
    tag: '諦深 · 2005.12.02',
    content: '一群雁飛過， 萬山竹蕭條；隱隱喝茶者， 似是飛來人。',
  ),
  PoemData(
    title: '無題三',
    tag: '諦深 · 2005.12.02',
    content: '唐詩堆裡尋江南， 麗草倩人美難羨；童心夢來原是癡， 篇篇胡文名人編。',
  ),
  PoemData(
    title: '少林寺訪古',
    tag: '諦深 · 2005.10.29',
    content: '宮粉冷墟艷火起，佛門尋己，個性未損面壁；走了半百歸故居，豈知換了弟子，傷透了假心一魂雲去，無人照看；枉美空塔四周，自己白扔錢財；清醒吧，玉才人還是當修下去！',
  ),
  PoemData(
    title: '入伏',
    tag: '諦深 · 2011.07.16',
    content: '遠嶺如線括，近林似扇寬；草低蛙聲起，樹高知了尖！忽聞懸鈴響，定有爽風添。',
  ),
  PoemData(
    title: '欣訪',
    tag: '諦深 · 2009.12.25',
    content: '一日知心百日情， 碧海西湖繫蘭綾；自古縱有千千貴， 不及故友觸門鈴！',
  ),
  PoemData(
    title: '清明',
    tag: '諦深 · 2009.12.25',
    content: '嫩雲吐絲漫山行， 雨滴疏落飛鳥鳴；荒崗君佇非為客， 只把思念慰祖靈。',
  ),
  PoemData(
    title: '日說',
    tag: '諦深 · 2009.04.10',
    content: '豔光普照，滄海陸域，綻生靈神變！求勻陰陽，賜眾個性，多冥思萬千。狂風本自為布福，生靈不知卻與譴，愚昧人間！問君曰：汝知幾何，參差這般？',
  ),
  PoemData(
    title: '初雪',
    tag: '諦深 · 2008.01.11',
    content: '夜來雲無聲，暗中送冬雪；晨曦留彩霓，紅日如巨戳；又逢好光景，學童戲中歌！',
  ),
  PoemData(
    title: '嶗山閱',
    tag: '諦深 · 2007.05.22',
    content: '上闋：欣欣木蘭樹，落落海都林；恍知不是夢，鳥鳴如家禽！\n下闋：端然超脫界，耳畔風如琴；又聞落雨聲，已入滿懷雲！',
  ),
  PoemData(
    title: '嶗山春雪題',
    tag: '諦深 · 2007.04.15',
    content: '桃花露雨谷中落，綿綿香草綠華川；懶懶暖風春頤立，唯舞白雪美嶗山！',
  ),
  PoemData(
    title: '詠 桂！',
    tag: '諦深 · 2006.11.10',
    content: '剪剪園葉影， 幽幽月下涼；嶗山深秋夜， 一谷桂花香！',
  ),
  PoemData(
    title: '冬 雪',
    tag: '諦深 · 2006.11.10',
    content: '晴雪日中掛島天， 柴扉老道掃門簷；遊人不識嶗山徑， 戌邊衛士舉鋼鞭！',
  ),
  PoemData(
    title: '明 道 觀',
    tag: '諦深 · 2006.10.30',
    content: '一山更比一山閑，一峰更比一峰健；東風引著西風去， 小小土蜂站樑樽！篝火成泥散落處， 明道觀碑佇千年！',
  ),
  PoemData(
    title: '獨 行 僧',
    tag: '諦深 · 2006.10.26',
    content: '一攬星雲盡手心，慈閱眾生滿塵衿；落足十方甘露遍，苦海撈離幾多人！',
  ),
  PoemData(
    title: '淚 情 門',
    tag: '諦深 · 2006.10.26',
    content: '土坯成壁千載磯， 所向披靡如無敵；誰人能過相思隙， 千古絕壁一情門！',
  ),
  PoemData(
    title: '絕 色 —— 贈嶗山九水',
    tag: '諦深 · 2006.10.25',
    content: '情人谷日出， 愛心花鳥鳴；卿卿屋簷燕， 伊人聽泉行；幽幽潭天裡， 絕色美峰影！',
  ),
  PoemData(
    title: '無題十',
    tag: '諦深 · 2006.10.14',
    content: '觀音菩薩妙難酬， 清淨莊嚴累劫修；眾生若於心中敬， 苦盡甘來露雨流；島城今朝有此瑞， 百百姓幸福無理由！島城人民美滿安逸，永無災殃！（島城市民百萬押寶「請」來觀音）',
  ),
  PoemData(
    title: '詠 秋',
    tag: '諦深 · 2006.10.13',
    content: '不是嶗山不留客， 雲峰海色留人魂；滿山紅葉銀露夢， 喜鵲遮天過松門！天鷹蒼鷺走靈渡， 朝霞金色海中陳！青竹迷眼又折桂， 神韻豪氣撞滿懷！',
  ),
  PoemData(
    title: '桂花月下螳螂',
    tag: '諦深 · 2006.10.07',
    content: '嶗山深秋並不涼， 枚枚菊花泛神香；依山面海雲起色， 桂花月下武螳螂！',
  ),
  PoemData(
    title: '送網友：潔',
    tag: '諦深 · 2006.10.07',
    content: '北京空氣最為貴， 家家只盼十月天；金秋送爽喜慶日， 不如嶗山黑雲旦！',
  ),
  PoemData(
    title: '無題九',
    tag: '諦深 · 2006.10.06',
    content: '中秋月下美，因有故人思；爬山追湖影，蟲鳴廟門囫；爽風識僧面，一運成天圖；又有世間信，念念滿心書。',
  ),
  PoemData(
    title: '夜 夜',
    tag: '諦深 · 2006.08.13',
    content: '君子謂相思，夜夜念故里。不戀住處貴，但愛嶗山雨；月下閑亭閣，鄉音有幾許？',
  ),
  PoemData(
    title: '夏 日 亭',
    tag: '諦深 · 2006.05.23',
    content: '夏日晌午布穀鳴， 玉女小扇向藍屏；熱風綠葉蒸茶藝， 巧嘴八哥水邊停。',
  ),
  PoemData(
    title: '嶗山春花',
    tag: '諦深 · 2006.04.23',
    content: '過樑春風不一般， 百鳥花仙依湛巒；峰峰攔雲關天路， 點霧杜鵑王母胭 。',
  ),
  PoemData(
    title: '無題五',
    tag: '諦深 · 2006.04.23',
    content: '一峰勝似一峰難， 一花更比一花豔；上上下下神香路， 絲絲入鼻能成仙！',
  ),
  PoemData(
    title: '讚觀音',
    tag: '諦深 · 2006.03.23',
    content: '眾生依附主，德被萬古秋；春雨滴塵界，觀音慈悲流！因汝觀世音，娑婆無難咎！',
  ),
  PoemData(
    title: '朝普陀',
    tag: '諦深 · 2006.03.18',
    content: '觀音菩薩妙難酬， 東海岸邊留因由；黃泥湯中建道地， 清靜世界眾生留！',
  ),
  PoemData(
    title: '普陀境',
    tag: '諦深 · 2006.03.18',
    content: '觀音悲雨潤海洲， 苦難眾生誠心求；一人一心皆遍應，如是娑婆善法酬！',
  ),
  PoemData(
    title: '下 山',
    tag: '諦深 · 2006.03.05',
    content: '死在峨嵋山，一點都不怨；諸業隨行了，恣在滿山川；唯觀名僧人，心中如黑炭！',
  ),
  PoemData(
    title: '峨 嵋',
    tag: '諦深 · 2006.03.05',
    content: '翠綠湧濤掩路穿， 寺廟鐘聲慈雲淹；天中藏有佳人路， 翩翩小鳥攀佛緣。',
  ),
  PoemData(
    title: '讚普賢',
    tag: '諦深 · 2006.03.04',
    content: '金頂淨光鋪無邊， 腳底不知幾層天；普賢金臺尋落處， 只見無頂不見山！',
  ),
  PoemData(
    title: '觀峨嵋',
    tag: '諦深 · 2006.03.04',
    content: '山挂綠樹直難觀， 前後左右全懸崖；雲中思山有多高， 可能峨嵋頂著天！',
  ),
  PoemData(
    title: '朝峨嵋',
    tag: '諦深 · 2006.03.03',
    content: '天府江樓朝北排，眉山霧色染霞靄；路路春風流雲住，突顯金光普賢來。',
  ),
  PoemData(
    title: '樂 山',
    tag: '諦深 · 2006.03.03',
    content: '細竹窄葉綠遮天， 三江白霧細繞船；彌樂腳下萬水盡，闊濤匯成天府源。',
  ),
  PoemData(
    title: '淨 地',
    tag: '諦深 · 2006.03.02',
    content: '絲絲柳絮掛湖輕， 纖纖暖風揉神鈴；晨板玉響鐘聲起， 一滅諸暗世界明。',
  ),
  PoemData(
    title: '膠州灣觀景',
    tag: '諦深 · 2006.03.02',
    content: '金波碎玉夜飛燈， 流光溢彩城山鳴；嶗峰珠巖海峽月， 一條巨輪如嶺行。',
  ),
  PoemData(
    title: '嶗 山',
    tag: '諦深 · 2006.02.17',
    content: '險峰次第朝天排， 綠嶺野雞花叢揣；海中碧波山頂住， 一枚白帆雲中來。',
  ),
  PoemData(
    title: '謎 語 詩',
    tag: '諦深 · 2006.02.17',
    content: '個個都是一聲命，嚇神治鬼不用兵；將帥對陣引作用，兩兵勝敗一錘定。',
  ),
  PoemData(
    title: '嶗山觀峰',
    tag: '諦深 · 2006.02.15',
    content: '橫看如雲豎成峰，遠近高低各不同；不識嶗山真面目，只因身在凡世中；海天山色看不住，雲月戲峰飛九洲；不是神人不住足，唯有仙人能停留。',
  ),
  PoemData(
    title: '無題4',
    tag: '諦深 · 2006.01.28',
    content: '瑞雪積豐門， 閑陽照景深；香繞雲端去， 柴爆爐火真；又到換歲日， 竹映腳印奔！',
  ),
  PoemData(
    title: '青 島',
    tag: '諦深 · 2006.01.18',
    content: '遠處千山近處樓，鏡海驚人從不休；金筆描岸人人醉，畫師倚礁眠過頭；青島山海不是夢，嶗山獨霸東神州。',
  ),
  PoemData(
    title: '天 山',
    tag: '諦深 · 2006.01.11',
    content: '天山之水天上流，四季如是夢中求；落腳夏風恰似火，抬頭積雪沒馬肘；樑底春天花還在，山脛松鼠忙秋收；羌人何故住氈包，寒來暑往無理由。',
  ),
  PoemData(
    title: '飛燕傳書',
    tag: '諦深 · 2006.01.11',
    content: '弱弱小燕啾屋簷，春來家眷聚屋山；神僧不知飛燕事，似為天中來信傳。',
  ),
  PoemData(
    title: '築 路 人',
    tag: '諦深 · 2006.01.11',
    content: '鐵錠鋼線穿南北，萬山披綠走神錐；不知天路誰劃出，解甲歸鄉白髮人。',
  ),
  PoemData(
    title: '建 廟',
    tag: '諦深 · 2005.12.25',
    content: '小妄成千國，萬緣不是頭；看看眾生苦，一廟貫宇宙。',
  ),
  PoemData(
    title: '靈 魂',
    tag: '諦深 · 2005.12.25',
    content: '今日機器飛， 更有電子輪；不如驢腿靈， 一跨千古魂。',
  ),
  PoemData(
    title: '雪中萬物',
    tag: '諦深 · 2005.12.19',
    content: '一隻雲雀飛長嶺，萬枚銀花飄荒山；冬來秋去自然境，老翁噓雪染戰船；冰下遊魚不見影，銀狐探水靈精歡；情女紅裝最為貴，一倩寒風滿冬暖。',
  ),
  PoemData(
    title: '賞 雪',
    tag: '諦深 · 2005.12.09',
    content: '潔衣精雕群似仙，隨風輕飛茫宇巒；人人人都愛玉美人，男女老少歡童玩！',
  ),
  PoemData(
    title: '綠 島',
    tag: '諦深 · 2005.12.09',
    content: '一座青山綠似蓮，雪濤襯蘭湧玉邊；狂風約雲狂作笑，佛塔坐峰淨萬年！',
  ),
  PoemData(
    title: '大 雪',
    tag: '諦深 · 2005.12.08',
    content: '本來樹窈窕，一夜成矮琨；出門爬冰坡，似進棉花屯；抬腿尚且難，原來雪太深！',
  ),
  PoemData(
    title: '參訪終南山',
    tag: '諦深 · 2005.10.22',
    content: '貧納昨夜行終南， 煙霧嗆盡萬徑纏；富僧佯修門緊閉， 滿目塵土入長安。',
  ),
  PoemData(
    title: '嶗山茶',
    tag: '諦深 · 2005.09.30',
    content: '嶗山仙人植桑麻， 冬雪紛飛不還家；一堆木條萬千葉， 居然雪峰把根紮；名字已經起好了， 從此就叫嶗山茶。',
  ),
  PoemData(
    title: '王母洗臉盆',
    tag: '諦深 · 2005.08.15',
    content: '石頂有一潭，水淺魚不歡；天軍令旱暴，居然它不乾；何故有此功，只因在嶗山。',
  ),
  PoemData(
    title: '對聯之一',
    tag: '諦深 · 2005.08.15',
    content: '一山一茶一壺仙， 萬峰萬水萬古魂。',
  ),
  PoemData(
    title: '對聯之二',
    tag: '諦深 · 2005.08.15',
    content: '壺小行萬水， 事大洗千人',
  ),
];